Ran Plan for dir: `ec2` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy

Terraform will perform the following actions:

  # aws_instance.private_es[0] will be created
+ resource "aws_instance" "private_es" {
      + ami                                  = "ami-08e4b984abde34a4f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "ec2_instance_profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "elasticsearch"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-000647f54b5fd59a6"
      + tags                                 = {
          + "Name" = "node-2"
        }
      + tags_all                             = {
          + "Name" = "node-2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "75010996da219eb5e39b6287e2c817c840df7a05"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0c0f7af2beb351257",
        ]
    }

  # aws_instance.private_es[1] will be created
+ resource "aws_instance" "private_es" {
      + ami                                  = "ami-08e4b984abde34a4f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "ec2_instance_profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "elasticsearch"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0480eb3937b1c0eb9"
      + tags                                 = {
          + "Name" = "node-3"
        }
      + tags_all                             = {
          + "Name" = "node-3"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "75010996da219eb5e39b6287e2c817c840df7a05"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0c0f7af2beb351257",
        ]
    }

  # aws_instance.public_es[0] will be updated in-place
~ resource "aws_instance" "public_es" {
        id                                   = "i-01d3c78caabffb85d"
      ~ tags                                 = {
          ~ "Name" = "es-1" -> "node-1"
        }
      ~ tags_all                             = {
          ~ "Name" = "es-1" -> "node-1"
        }
        # (29 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_instance.public_es[1] will be destroyed
  # (because index [1] is out of range for count)
- resource "aws_instance" "public_es" {
      - ami                                  = "ami-08e4b984abde34a4f" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-0e255492db83631d5" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-southeast-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0e255492db83631d5" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "elasticsearch" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-04946e40a1f146ebb" -> null
      - private_dns                          = "ip-192-168-0-49.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "192.168.0.49" -> null
      - public_ip                            = "13.212.58.126" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0dfbdd4090e8ab3e4" -> null
      - tags                                 = {
          - "Name" = "es-2"
        } -> null
      - tags_all                             = {
          - "Name" = "es-2"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "75010996da219eb5e39b6287e2c817c840df7a05" -> null
      - vpc_security_group_ids               = [
          - "sg-08ff17d6e864e37fc",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0d8f75b072b6a494b" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.public_es[2] will be destroyed
  # (because index [2] is out of range for count)
- resource "aws_instance" "public_es" {
      - ami                                  = "ami-08e4b984abde34a4f" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-04c99316f5522483c" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-southeast-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-04c99316f5522483c" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "elasticsearch" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-09a6d1432f1a214ed" -> null
      - private_dns                          = "ip-192-168-1-228.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "192.168.1.228" -> null
      - public_ip                            = "175.41.167.101" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0f9ffe2b308d35846" -> null
      - tags                                 = {
          - "Name" = "es-3"
        } -> null
      - tags_all                             = {
          - "Name" = "es-3"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "75010996da219eb5e39b6287e2c817c840df7a05" -> null
      - vpc_security_group_ids               = [
          - "sg-08ff17d6e864e37fc",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ea35218ce841427c" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_security_group.public_es_sg will be updated in-place
~ resource "aws_security_group" "public_es_sg" {
        id                     = "sg-08ff17d6e864e37fc"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = -1
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "icmp"
              - security_groups  = []
              - self             = false
              - to_port          = -1
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 9200
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9200
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 9300
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9300
            },
          - {
              - cidr_blocks      = [
                  - "192.168.0.0/16",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 9200
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9200
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 9300
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9300
            },
          + {
              + cidr_blocks      = [
                  + "192.168.0.0/16",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "public_es_ec2_security_group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://a3235ad69b8a:4141/lock?id=tampubolon%252Felasticsearch-lab%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d ec2`
</details>
Plan: 2 to add, 2 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`